package ru.liahim.mist.core.asm;


/**
 * Р вЂ™ Р В·Р В°Р Р†Р С‘РЎРѓР С‘Р С�Р С•РЎРѓРЎвЂљР С‘ Р С•РЎвЂљ РЎРЊРЎвЂљР С•Р С–Р С• Р В·Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘РЎРЏ Р С•Р С—РЎР‚Р ВµР Т‘Р ВµР В»РЎРЏР ВµРЎвЂљРЎРѓРЎРЏ, РЎвЂЎРЎвЂљР С• Р Р†Р ВµРЎР‚Р Р…РЎвЂ�РЎвЂљ РЎвЂ Р ВµР В»Р ВµР Р†Р С•Р в„– Р С�Р ВµРЎвЂљР С•Р Т‘
 * Р С—РЎР‚Р С‘ Р Р†РЎвЂ№РЎвЂ¦Р С•Р Т‘Р Вµ return Р С—Р С•РЎРѓР В»Р Вµ Р Р†РЎвЂ№Р В·Р С•Р Р†Р В° РЎвЂ¦РЎС“Р С”-Р С�Р ВµРЎвЂљР С•Р Т‘Р В°.
 */
public enum ReturnValue {

    /**
     * Р вЂ™Р С•Р В·Р Р†РЎР‚Р В°РЎвЂ°Р В°Р ВµРЎвЂљРЎРѓРЎРЏ void.
     * Р пїЅРЎРѓР С—Р С•Р В»РЎРЉР В·РЎС“Р ВµРЎвЂљРЎРѓРЎРЏ РЎвЂљР С•Р С–Р Т‘Р В° Р С‘ РЎвЂљР С•Р В»РЎРЉР С”Р С• РЎвЂљР С•Р С–Р Т‘Р В°, Р С”Р С•Р С–Р Т‘Р В° РЎвЂ Р ВµР В»Р ВµР Р†Р С•Р в„– Р С�Р ВµРЎвЂљР С•Р Т‘ Р Р†Р С•Р В·Р Р†РЎР‚Р В°РЎвЂ°Р В°Р ВµРЎвЂљ void.
     */
    VOID,

    /**
     * Р вЂ™Р С•Р В·Р Р†РЎР‚Р В°РЎвЂ°Р В°Р ВµРЎвЂљРЎРѓРЎРЏ Р В·Р В°РЎР‚Р В°Р Р…Р ВµР Вµ РЎС“РЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р В»Р ВµР Р…Р Р…Р С•Р Вµ Р С—РЎР‚Р С‘Р С�Р С‘РЎвЂљР С‘РЎвЂЎР Р…Р С•Р Вµ Р В·Р Р…Р В°РЎвЂЎР ВµР Р…Р С‘Р Вµ.
     * Р СљР С•Р В¶Р Р…Р С• Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉ РЎвЂљР С•Р В»РЎРЉР С”Р С• Р С”Р С•Р С–Р Т‘Р В° РЎвЂ Р ВµР В»Р ВµР Р†Р С•Р в„– Р С�Р ВµРЎвЂљР С•Р Т‘ Р Р†Р С•Р В·Р Р†РЎР‚Р В°РЎвЂ°Р В°Р ВµРЎвЂљ Р С—РЎР‚Р С‘Р С�Р С‘РЎвЂљР С‘Р Р†.
     */
    PRIMITIVE_CONSTANT,

    /**
     * Р вЂ™Р С•Р В·Р Р†РЎР‚Р В°РЎвЂ°Р В°Р ВµРЎвЂљРЎРѓРЎРЏ null.
     * Р СљР С•Р В¶Р Р…Р С• Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉ РЎвЂљР С•Р В»РЎРЉР С”Р С• Р С”Р С•Р С–Р Т‘Р В° РЎвЂ Р ВµР В»Р ВµР Р†Р С•Р в„– Р С�Р ВµРЎвЂљР С•Р Т‘ Р Р†Р С•Р В·Р Р†РЎР‚Р В°РЎвЂ°Р В°Р ВµРЎвЂљ Р С•Р В±РЎР‰Р ВµР С”РЎвЂљ.
     */
    NULL,

    /**
     * Р вЂ™Р С•Р В·Р Р†РЎР‚Р В°РЎвЂ°Р В°Р ВµРЎвЂљРЎРѓРЎРЏ РЎвЂљР С•РЎвЂљ Р С—РЎР‚Р С‘Р С�Р С‘РЎвЂљР С‘Р Р† Р С‘Р В»Р С‘ Р С•Р В±РЎР‰Р ВµР С”РЎвЂљ, Р С”Р С•РЎвЂљР С•РЎР‚РЎвЂ№Р в„– Р Р†Р ВµРЎР‚Р Р…РЎС“Р В» РЎвЂ¦РЎС“Р С”-Р С�Р ВµРЎвЂљР С•Р Т‘.
     * Р СљР С•Р В¶Р Р…Р С• Р С‘РЎРѓР С—Р С•Р В»РЎРЉР В·Р С•Р Р†Р В°РЎвЂљРЎРЉ Р Р†Р С• Р Р†РЎРѓР ВµРЎвЂ¦ РЎРѓР В»РЎС“РЎвЂЎР В°РЎРЏРЎвЂ¦, Р С”РЎР‚Р С•Р С�Р Вµ РЎвЂљР С•Р С–Р С•, Р С”Р С•Р С–Р Т‘Р В° РЎвЂ Р ВµР В»Р ВµР Р†Р С•Р в„– Р С�Р ВµРЎвЂљР С•Р Т‘ Р Р†Р С•Р В·Р Р†РЎР‚Р В°РЎвЂ°Р В°Р ВµРЎвЂљ void.
     */
    HOOK_RETURN_VALUE,

    /**
     * Р вЂ™РЎвЂ№Р В·РЎвЂ№Р Р†Р В°Р ВµРЎвЂљ Р Т‘РЎР‚РЎС“Р С–Р С•Р в„– Р С�Р ВµРЎвЂљР С•Р Т‘ Р Р† РЎвЂљР С•Р С� Р В¶Р Вµ Р С”Р В»Р В°РЎРѓРЎРѓР Вµ Р С‘ РЎРѓ РЎвЂљР ВµР С�Р С‘ Р В¶Р Вµ Р С—Р В°РЎР‚Р В°Р С�Р ВµРЎвЂљРЎР‚Р В°Р С�Р С‘, РЎвЂЎРЎвЂљР С• Р С‘ РЎвЂ¦РЎС“Р С”-Р С�Р ВµРЎвЂљР С•Р Т‘, Р Р…Р С• РЎРѓ Р Т‘РЎР‚РЎС“Р С–Р С‘Р С� Р Р…Р В°Р В·Р Р†Р В°Р Р…Р С‘Р ВµР С�.
     * Р вЂ™Р С•Р В·Р Р†РЎР‚Р В°РЎвЂ°Р В°Р ВµРЎвЂљ Р С—РЎР‚Р С‘Р С�Р С‘РЎвЂљР С‘Р Р† Р С‘Р В»Р С‘ Р С•Р В±РЎР‰Р ВµР С”РЎвЂљ, Р С”Р С•РЎвЂљР С•РЎР‚РЎвЂ№Р в„– Р Р†Р ВµРЎР‚Р Р…РЎС“Р В» Р Р†РЎвЂ№Р В·Р Р†Р В°Р Р…Р Р…РЎвЂ№Р в„– Р С�Р ВµРЎвЂљР С•Р Т‘.
     */
    ANOTHER_METHOD_RETURN_VALUE

}
